exampleCases/CondensationWedge/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
	(0.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000) // 0
	(5.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000) // 1
	(5.0000000000000000000000000 0.0299954308546917375322138 -0.0005235721931185053799537) // 2
	(0.0000000000000000000000000 0.0299954308546917375322138 -0.0005235721931185053799537) // 3
	(5.0000000000000000000000000 0.0299954308546917375322138 0.0005235721931185050546931) // 4
	(0.0000000000000000000000000 0.0299954308546917375322138 0.0005235721931185050546931) // 5
	(5.0000000000000000000000000 0.1169821803332977833145279 -0.0020419315531621708842414) // 6
	(0.0000000000000000000000000 0.1169821803332977833145279 -0.0020419315531621708842414) // 7
	(5.0000000000000000000000000 0.1169821803332977833145279 0.0020419315531621700168796) // 8
	(0.0000000000000000000000000 0.1169821803332977833145279 0.0020419315531621700168796) // 9
	(-0.2500000000000000000000000 0.0299954308546917375322138 -0.0005235721931185053799537) // 10
	(-0.2500000000000000000000000 0.1169821803332977833145279 -0.0020419315531621708842414) // 11
	(-0.2500000000000000000000000 0.0299954308546917375322138 0.0005235721931185050546931) // 12
	(-0.2500000000000000000000000 0.1169821803332977833145279 0.0020419315531621700168796) // 13
	(5.0000000000000000000000000 1.9996953903127825391550232 -0.0349048128745670233064047) // 14
	(0.0000000000000000000000000 1.9996953903127825391550232 -0.0349048128745670233064047) // 15
	(5.0000000000000000000000000 1.9996953903127825391550232 0.0349048128745670094286169) // 16
	(0.0000000000000000000000000 1.9996953903127825391550232 0.0349048128745670094286169) // 17
	(-0.2500000000000000000000000 1.9996953903127825391550232 -0.0349048128745670233064047) // 18
	(-0.2500000000000000000000000 1.9996953903127825391550232 0.0349048128745670094286169) // 19
	(-1.0000000000000000000000000 0.0299954308546917375322138 -0.0005235721931185053799537) // 20
	(-1.0000000000000000000000000 0.1169821803332977833145279 -0.0020419315531621708842414) // 21
	(-1.0000000000000000000000000 0.0299954308546917375322138 0.0005235721931185050546931) // 22
	(-1.0000000000000000000000000 0.1169821803332977833145279 0.0020419315531621700168796) // 23
	(-1.0000000000000000000000000 1.9996953903127825391550232 -0.0349048128745670233064047) // 24
	(-1.0000000000000000000000000 1.9996953903127825391550232 0.0349048128745670094286169) // 25
);

blocks
(
	hex ( 0 1 2 3 0 1 4 5 )  ( 70 10 1 ) simpleGrading ( 1.9868944241538464 1 1 ) // 0 
	hex ( 3 2 6 7 5 4 8 9 )  ( 70 29 1 ) simpleGrading ( 1.9868944241538464 1 1 ) // 1 
	hex ( 10 3 7 11 12 5 9 13 )  ( 5 29 1 ) simpleGrading ( 1 1 1 ) // 2 
	hex ( 7 6 14 15 9 8 16 17 )  ( 70 72 1 ) simpleGrading ( 1.9868944241538464 31.947746812289633 1 ) // 3 
	hex ( 11 7 15 18 13 9 17 19 )  ( 5 72 1 ) simpleGrading ( 1 31.947746812289633 1 ) // 4 
	hex ( 20 10 11 21 22 12 13 23 )  ( 12 29 1 ) simpleGrading ( 0.5846792890864372 1 1 ) // 5 
	hex ( 21 11 18 24 23 13 19 25 )  ( 12 72 1 ) simpleGrading ( 0.5846792890864372 31.947746812289633 1 ) // 6 
);

edges
(
	// arc 6 8 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 6 8 (5.0000000000000000000000000 0.1170000000000000067723605 -0.0000000000000000004336809)
	// arc 7 9 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 7 9 (0.0000000000000000000000000 0.1170000000000000067723605 -0.0000000000000000004336809)
	// arc 11 13 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 11 13 (-0.2500000000000000000000000 0.1170000000000000067723605 -0.0000000000000000004336809)
	// arc 14 16 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 14 16 (5.0000000000000000000000000 2.0000000000000000000000000 -0.0000000000000000069388939)
	// arc 15 17 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 15 17 (0.0000000000000000000000000 2.0000000000000000000000000 -0.0000000000000000069388939)
	// arc 18 19 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 18 19 (-0.2500000000000000000000000 2.0000000000000000000000000 -0.0000000000000000069388939)
	// arc 21 23 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 21 23 (-1.0000000000000000000000000 0.1170000000000000067723605 -0.0000000000000000004336809)
	// arc 24 25 0.03490658503988659 (1.0000000000000000000000000 0.0000000000000000000000000 0.0000000000000000000000000)
	arc 24 25 (-1.0000000000000000000000000 2.0000000000000000000000000 -0.0000000000000000069388939)
);

faces
(
);

boundary
(
	wedge_back
	{
		type wedge;
		faces
		(
			(0 1 2 3)
			(3 2 6 7)
			(10 3 7 11)
			(7 6 14 15)
			(11 7 15 18)
			(20 10 11 21)
			(21 11 18 24)
		);
	}
	wedge_front
	{
		type wedge;
		faces
		(
			(0 1 4 5)
			(5 4 8 9)
			(12 5 9 13)
			(9 8 16 17)
			(13 9 17 19)
			(22 12 13 23)
			(23 13 19 25)
		);
	}
	pipe
	{
		type wall;
		faces
		(
			(12 5 3 10)
			(22 12 10 20)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(1 1 2 4)
			(4 2 6 8)
			(8 6 14 16)
		);
	}
	inlet_inner
	{
		type patch;
		faces
		(
			(0 0 3 5)
		);
	}
	inlet_outer
	{
		type patch;
		faces
		(
			(22 20 21 23)
			(23 21 24 25)
		);
	}
);

defaultPatch
{
	name upper;
	type patch;
}

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
