exampleCases/CondensationWedge/constant/reactions
species
(
    air
    vapourH2O
    liquidH2O
);

reactions
{
}
