exampleCases/CondensationWedge/0.org/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (5.000000 0 0);

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type noSlip;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet_inner
  {
    type fixedValue;
    value uniform (10.000000 0 0);
  }
  inlet_outer
  {
    type fixedValue;
    value uniform (5.000000 0 0);
  }
  upper
  {
    type inletOutlet;
    inletValue uniform (5.000000 0 0);
    value uniform (5.000000 0 0);
  }
} 	// ************************************************************************* //

