exampleCases/CondensationWedge/0.org/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object p;
}

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 26499.900000;

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type zeroGradient;
  }
  outlet
  {
    type fixedValue;
    value uniform 26499.900000;
  }
  inlet_inner
  {
    type zeroGradient;
  }
  inlet_outer
  {
    type zeroGradient;
  }
  upper
  {
    type outletInlet;
    inletValue uniform 100000.0;
    value uniform 26499.900000;
    outletValue uniform 26499.900000;
  }
} 	// ************************************************************************* //

