exampleCases/CondensationWedge/0.org/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 223.250000;

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type zeroGradient;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet_inner
  {
    type fixedValue;
    value uniform 500.000000;
  }
  inlet_outer
  {
    type fixedValue;
    value uniform 223.250000;
  }
  upper
  {
    type inletOutlet;
    value uniform 223.250000;
    inletValue uniform 223.250000;
  }
} 	// ************************************************************************* //

