exampleCases/CondensationWedge/0.org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wedge_back
    {
        type            wedge;
    }
    wedge_front
    {
        type            wedge;
    }
    pipe
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet_inner
    {
        type            calculated;
        value           uniform 0;
    }
    inlet_outer
    {
        type            calculated;
        value           uniform 0;
    }
    upper
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
