exampleCases/CondensationWedge/0.org/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type nutkWallFunction;
    value uniform 0;
  }
  outlet
  {
    type calculated;
    value uniform 0;
  }
  inlet_inner
  {
    type calculated;
    value uniform 0;
  }
  inlet_outer
  {
    type calculated;
    value uniform 0;
  }
  upper
  {
    type calculated;
    value uniform 0;
  }
} 	// ************************************************************************* //

