exampleCases/CondensationWedge/0.org/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object omega;
}

dimensions [ 0 0 -1 0 0 0 0 ];

internalField uniform 37.267800;

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type omegaWallFunction;
    value uniform 100;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet_inner
  {
    type fixedValue;
    value uniform 37.267800;
  }
  inlet_outer
  {
    type inletOutlet;
    inletValue uniform 37.267800;
    value uniform 37.267800;
  }
  upper
  {
    type inletOutlet;
    inletValue uniform 37.267800;
    value uniform 37.267800;
  }
} 	// ************************************************************************* //

