exampleCases/CondensationWedge/0.org/vapourH2O
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 arch "LSB;label=32;scalar=64";
 class volScalarField;
 location "0";
 object chiVapour;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  wedge_back
  {
    type wedge;
  }
  wedge_front
  {
    type wedge;
  }
  pipe
  {
    type zeroGradient;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet_inner
  {
    type fixedValue;
    value uniform 0.01;
  }
  inlet_outer
  {
    type fixedValue;
    value uniform 0;
  }
  upper
  {
    type inletOutlet;
    inletValue uniform 0;
    value uniform 0;
  }

} 	// ************************************************************************* //

