exampleCases/CondensationWedge/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSchemes;
}

ddtSchemes
{
  default Euler;
}

gradSchemes
{
  default leastSquares;
}

divSchemes
{
  default none;
  scalars Gauss vanLeer ; 	//upwind; 	//linearUpwind default;
  div(phi,U) Gauss blended       0.8 ;
  div(phi,K) $scalars;
  div(phi,h) $scalars;
  div(phi,k) $scalars;
  div(phi,R) $scalars;
  div(phi,Ekp) $scalars;
  div(phi,e) $scalars;
  div(phi,omega) $scalars;
  div(phi,Yi_h) Gauss multivariateSelection {
        air limitedLinear01             1 ;
        h limitedLinear                 1 ;
        liquidH2O limitedLinear01       1 ;
        vapourH2O limitedLinear01       1 ;
      } ;
  div(phi,epsilon) $scalars;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear ;
  div(Ji,Ii_h) $scalars;
  div(((rho*(thermo:mu|rho))*dev2(T(grad(U))))) Gauss linear ;
  div((rho*R)) Gauss linear ;
  div(phi,vapourH2O) $scalars;
}

laplacianSchemes
{
  default Gauss linear uncorrected ;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

wallDist
{
  method meshWave;
  nRequired yes;
} 	// ************************************************************************* //// ************************************************************************* //

