exampleCases/CondensationWedge/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSolution;
}

solvers
{
  "(rho|rhoFinal)"
  {
      solver              diagonal;
  };
  p
  {
    solver GAMG;
    tolerance 1e-06;
    relTol 0.01;
    smoother GaussSeidel;
  }
  pFinal
    {
        $p;
        tolerance           1e-6;
        relTol              0;
        maxIter             100;
    };
  "(U|Yi|k|h|epsilon|R|omega|e)"
  {
    solver PBiCGStab;
    preconditioner DILU;
    tolerance 1e-06;
    relTol 0.01;
    nSweeps 1;
  }
  "(U|Yi|k|h|epsilon|R|omega|e)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    };
}

PIMPLE
{
  momentumPredictor yes;
  nOuterCorrectors 1;
  nCorrectors 2;
  nNonOrthogonalCorrectors 0;
}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pMinFactor 0.4;
  pMaxFactor 1.5;
  residualControl
  {
    p 0.01;
    U 0.0001;
    e 0.001;
    "(k|epsilon)" 0.001;
  }
}

relaxationFactors
{
  fields
  {
    p 0.3;
    rho 0.01;
  }
  equations
  {
    U 0.7;
    "(k|epsilon|omega|R|chiVapour)" 0.7;
    e 0.5;
    "(CH4|O2|H2O|CO2|h).*" 1;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
    "(k|epsilon|omega|R)" 0.7;
  }
} 	/*
relaxationFactors
{
    equations
    {
        "(U|k).*"                   1;
        "(CH4|O2|H2O|CO2|h).*"      1;
    }
} */// ************************************************************************* //

