exampleCases/CondensationWedge/system/decomposeParDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object decomposeParDict;
}

numberOfSubdomains 4;

method scotch; 	// ************************************************************************* //

