exampleCases/CondensationWedge/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Preload any required fields (optional)
//defaultFieldValues
//(
  //  volVectorFieldValue U           (0. 0. 0.)
//);


_jetVel //seperated so we can write into it with PyFoam
{
    variables   ( "l=3" "ri = 0.03" "Ui = 10");
    condition   #{ (pos().y() < ri && pos().x() < l)#};
    expression  #{ vector(Ui * (1 - 0.5 * (pos().x() / l) ), 0, 0) #};
}

expressions
(
    U
    {
        field   U;
        dimensions  [0 1 -1 0 0 0 0];
        //create  yes;
        $_jetVel;
    }
);


// ************************************************************************* //
